mavishak/cnss-embedded/stm32-f103rb-cnss/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialised, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include "stm32f103xb.h"
// #include "cmsis_gcc.h"/*for __disable/enable_irq()*/
// #include "core_cm3.h" /*for NVIC_enableIRQ() and NVIC_SetPriority()*/


#include "event_queue.h"
#include "hc-sr501pir_sensor.h"
#include "usart.h"
#include "esp8266_Firebase.h"
#include "esp8266_WiFi.h" //for testing usart1...
#include "timers.h"
#include "common.h"
#include "i2c.h"
#include "clock.h"
#include "system_control.h"
#include "configurations.h"
#include "led.h"


/*FOR TESTING*/
//#include "gpio_signal.h" /*for testing*/
/*FOR TESTING*/


int main(void)
{
	//set_sys_clock_to_32MHz();
	//init_MCO();




	USART1_init(); // for ESP8266
	USART2_init(); // for debugging

	QUEUE_init();

	CONFIGURATIONS_set_device_id();

	init_sensor_with_interrupt(); // sensor interrupts are not inabled

	LED_init();

	TIMER2_init(); // for monitoring switch state.
	TIMER3_init(); // for sensor delay
	TIMER4_init(); // for ESP8266 timeout

	USART2_enable_Rx(); // for ESC


	//init_i2c1();
	USART2_write((uint8_t*)("\r\n_______________\r\n"));//For test

	//CONFIGURATIONS_set_network(); // returns true or false


	while(1)
	{

		QUEUE_do_event();
		SYSTEM_CONTROL_monitor_switch_state(120); // every 2 minutes

	}
}
